
_createKeys(){
    const fragment = document.createDocumentFragment();
    const keyLayout = [
        "あ", "い", "う", "え", "お", "ア", "イ", "ウ", "エ", "オ", "か", "き", "く", "け", "こ", "カ", "キ", "ク", "ケ", "コ", "さ", "し", "す", "せ", "そ", "サ", "シ", "ス", "セ", "ソ", "た", "ち", "つ", "て", "と", "タ", "チ", "ツ", "テ", "ト", "な", "に", "ぬ", "ね", "の", "ナ", "ニ", "ヌ", "ネ", "ノ", "は", "ひ", "ふ", "へ", "ほ", "ハ", "ヒ", "フ", "へ", "ホ", "ま", "み", "む", "め", "も", "マ", "ミ", "ム", "メ", "モ", "や", "ゆ", "よ", "ヤ", "ユ", "ヨ", "ら", "り", "る", "れ", "ろ", "ラ", "リ", "ル", "レ", "ロ", "わ", "を", "ワ", "ヲ", "が", "ガ", "ぎ", "ギ", "ぐ", "グ", "げ", "ゲ", "ご", "ゴ", "ザ", "ざ", "じ", "ジ", "ず", "ズ", "ぜ", "ゼ", "ぞ", "ゾ", "だ", "ぢ", "づ", "で", "ど", "だ", "ぢ", "づ", "で", "ど", "ば", "び", "ぶ", "べ", "ぼ", "バ", "ビ", "ブ", "ベ", "ボ", "ぴ", "ぺ", "ぱ", "ぷ", "ぽ", "パ", "ピ", "プ", "ペ", "ポ", "ぁ", "ぃ", "ぅ", "ぇ", "ぉ", "ゔ", "ァ", "ィ", "ゥ", "ェ", "ォ", "ヴ", "・", "ヽ", "ヾ", "ー", "ゝ", "ゞ", "、", "。"
    ];
}